import torch
from termcolor import colored


fushimi1999_dict = {
    'HF___consist__': ['戦争', '倉庫', '医学', '注意', '記念', '番号', '料理', '完全', '開始', '印刷',
                    '連続', '予約', '多少', '教員', '当局', '材料', '夕刊', '労働', '運送', '電池'],  # consistent, 'high-frequency words
    'HF___inconsist': ['反対', '失敗', '作品', '指定', '実験', '決定', '独占', '独身', '固定', '食品',
                        '表明', '安定', '各種', '役所', '海岸', '決算', '地帯', '道路', '安打', '楽団'],  # inconsistent, 'high-frequency words
    'HF___atypical_': ['仲間', '夫婦', '人間', '神経', '相手', '反発', '化粧', '建物', '彼女', '毛糸',
                        '場合', '台風', '夜間', '人形', '東西', '地元', '松原', '競馬', '大幅', '貸家'],  # inconsistent atypical, 'high-frequency words
    'LF___consist__': ['集計', '観察', '予告', '動脈', '理学', '信任', '任務', '返信', '医局', '低温',
                        '区別', '永続', '持続', '試練', '満開', '軍備', '製材', '銀貨', '急送', '改選'],  # consistent, 'low-frequency words
    'LF___inconsist': ['表紙', '指針', '熱帯', '作詞', '決着', '食費', '古代', '地形', '役場', '品種',
                        '祝福', '金銭', '根底', '接種', '経由', '郷土', '街路', '宿直', '曲折', '越境'],  # inconsistent, 'low-frequency words
    'LF___atypical_': ['強引', '寿命', '豆腐', '出前', '歌声', '近道', '間口', '風物', '面影', '眼鏡',
                        '居所', '献立', '小雨', '毛皮', '鳥居', '仲買', '頭取', '極上', '奉行', '夢路'],  # inconsistent atypical, 'low-frequency words
    'HFNW_consist__': ['集学', '信別', '製信', '運学', '番送', '電続', '完意', '軍開', '動選', '当働',
                        '予続', '倉理', '予少', '教池', '理任', '銀務', '連料', '開員', '注全', '記争'],  # consistent, 'high-character-frequency non-words
    'HFNW_inconsist': ['作明', '風行', '失定', '指団', '決所', '各算', '海身', '東発', '楽験', '作代',
                        '反原', '独対', '歌上', '反定', '独定', '場家', '安種', '経着', '決土', '松合'],  # inconsistent biased, 'high-character-frequency non-words
    'HFNW_ambiguous': ['表品', '実定', '人風', '神間', '相経', '人元', '小引', '指場', '毛所', '台手',
                        '間物', '道品', '出取', '建馬', '大婦', '地打', '化間', '面口', '金由', '彼間'],  # inconsistent ambiguous, 'high-character-frequency non-words
    'LFNW_consist__': ['急材', '戦刊', '返計', '印念', '低局', '労号', '満送', '永告', '試脈', '観備',
                        '材約', '夕局', '医庫', '任続', '医貨', '改練', '区温', '多始', '材刷', '持察'],  # consistent, 'low-character-frequency non-words
    'LFNW_inconsist': ['食占', '表底', '宿帯', '決帯', '古費', '安敗', '役針', '近命', '眼道', '豆立',
                        '街直', '固路', '郷種', '品路', '曲銭', '献居', '奉買', '根境', '役岸', '祝折'],  # inconsistent biased, 'low-character-frequency non-words
    'LFNW_ambiguous': ['食形', '接紙', '競物', '地詞', '強腐', '頭路', '毛西', '夜糸', '仲影', '熱福',
                        '寿前', '鳥雨', '地粧', '越種', '仲女', '極鏡', '夢皮', '居声', '貸形', '夫幅'],  # inconsistent ambiguous, 'low-character-frequency non-words
}

def _fushimi1999_list(verbose:bool = False):

    fushimi1999_list = []
    for k, v in fushimi1999_dict.items():
        for _v in v:
            fushimi1999_list.append(_v)

    if verbose:
        print(colored('# Fushimi1999 データから，訓練データに含まれているデータを表示する',
                      'blue', attrs=['bold']))
        for i, wrd in enumerate(fushimi1999_list):
            if wrd in train_wordlist:
                color = 'blue'
                idx = train_wordlist.index(wrd)
            else:
                color = 'red'
                idx = -1
            print(colored((f'{i:3d} wrd:{wrd},idx:{idx:5d}',
                           f'orth_tkn2ids:{orth_tkn2ids(wrd)}',  # o[_tgt]
                           ), color=color, attrs=['bold']))
    print(f'fushimi1999_list:{fushimi1999_list}') if verbose else None

    return fushimi1999_list


def check_fushimi_list(
    #wordlist:list=None,
    encoder:torch.nn.Module=None, #encoder,
    decoder:torch.nn.Module=None, # decoder,
    is_print:bool=False,
    )->str:

    ret_msg = ""
    counter = 1
    for key, val in fushimi1999.items():
        key_old = ""
        if key != key_old:
            key_old = key
            ret_msg += f'{key}:'
            if is_print:
                print(colored(f'{key}:', 'green', attrs=['bold']), end=" ")
        
        n_ok, n_all = 0, 0
        msg = ""
        for wrd in val:
            _orth = _vocab.orth_tkn2ids(wrd) + [_vocab.orth_vocab.index('<EOW>')]
            ans=evaluate(encoder,
                         decoder,
                         _orth,
                         _vocab.max_length,
                         source_vocab,
                         target_vocab,
                         source_ids,
                         target_ids)
            
            res = "".join(p for p in ans[0][:-1])  # モデルからの戻り値を再構成
            if res == wrd:
                n_ok += 1
            n_all += 1

            counter =  1 if (counter % 10) == 0 else (counter + 1)
            _end = "\n" if counter==1 else ", "
            msg += f"{wrd}->/{res}/{_end}"
            
        ret_msg += f'{n_ok/n_all * 100:5.2f}%\n{msg}'
        if is_print:
            print(f'{n_ok/n_all * 100:5.2f}%\n{msg}')
            
    return ret_msg


fushimi1999_rt = {
    0:{'wrd':'戦争', 'RT':433},
    1:{'wrd':'倉庫', 'RT':455},
    2:{'wrd':'医学', 'RT':465},
    3:{'wrd':'注意', 'RT':472},
    4:{'wrd':'記念', 'RT':476},
    5:{'wrd':'番号', 'RT':477},
    6:{'wrd':'料理', 'RT':483},
    7:{'wrd':'完全', 'RT':487},
    8:{'wrd':'開始', 'RT':489},
    9:{'wrd':'印刷', 'RT':496},
    10:{'wrd':'連続', 'RT':499},
    11:{'wrd':'予約', 'RT':503},
    12:{'wrd':'多少', 'RT':504},
    13:{'wrd':'教員', 'RT':507},
    14:{'wrd':'当局', 'RT':508},
    15:{'wrd':'材料', 'RT':508},
    16:{'wrd':'夕刊', 'RT':515},
    17:{'wrd':'労働', 'RT':527},
    18:{'wrd':'運送', 'RT':538},
    19:{'wrd':'電池', 'RT':542},
    20:{'wrd':'反対', 'RT':411},
    21:{'wrd':'失敗', 'RT':412},
    22:{'wrd':'作品', 'RT':412},
    23:{'wrd':'指定', 'RT':430},
    24:{'wrd':'実験', 'RT':446},
    25:{'wrd':'決定', 'RT':457},
    26:{'wrd':'独占', 'RT':466},
    27:{'wrd':'独身', 'RT':472},
    28:{'wrd':'固定', 'RT':479},
    29:{'wrd':'食品', 'RT':486},
    30:{'wrd':'表明', 'RT':488},
    31:{'wrd':'安定', 'RT':499},
    32:{'wrd':'各種', 'RT':500},
    33:{'wrd':'役所', 'RT':523},
    34:{'wrd':'海岸', 'RT':529},
    35:{'wrd':'決算', 'RT':535},
    36:{'wrd':'地帯', 'RT':555},
    37:{'wrd':'道路', 'RT':571},
    38:{'wrd':'安打', 'RT':655},
    39:{'wrd':'楽団', 'RT':684},
    40:{'wrd':'仲間', 'RT':431},
    41:{'wrd':'夫婦', 'RT':435},
    42:{'wrd':'人間', 'RT':441},
    43:{'wrd':'神経', 'RT':461},
    44:{'wrd':'相手', 'RT':464},
    45:{'wrd':'反発', 'RT':466},
    46:{'wrd':'化粧', 'RT':479},
    47:{'wrd':'建物', 'RT':497},
    48:{'wrd':'彼女', 'RT':500},
    49:{'wrd':'毛糸', 'RT':501},
    50:{'wrd':'場合', 'RT':502},
    51:{'wrd':'台風', 'RT':514},
    52:{'wrd':'夜間', 'RT':517},
    53:{'wrd':'人形', 'RT':518},
    54:{'wrd':'東西', 'RT':545},
    55:{'wrd':'地元', 'RT':549},
    56:{'wrd':'松原', 'RT':556},
    57:{'wrd':'競馬', 'RT':579},
    58:{'wrd':'大幅', 'RT':703},
    59:{'wrd':'貸家', 'RT':811},
    60:{'wrd':'集計', 'RT':451},
    61:{'wrd':'観察', 'RT':476},
    62:{'wrd':'予告', 'RT':481},
    63:{'wrd':'動脈', 'RT':490},
    64:{'wrd':'理学', 'RT':494},
    65:{'wrd':'信任', 'RT':497},
    66:{'wrd':'任務', 'RT':499},
    67:{'wrd':'返信', 'RT':518},
    68:{'wrd':'医局', 'RT':519},
    69:{'wrd':'低温', 'RT':522},
    70:{'wrd':'区別', 'RT':539},
    71:{'wrd':'永続', 'RT':560},
    72:{'wrd':'持続', 'RT':567},
    73:{'wrd':'試練', 'RT':572},
    74:{'wrd':'満開', 'RT':574},
    75:{'wrd':'軍備', 'RT':576},
    76:{'wrd':'製材', 'RT':578},
    77:{'wrd':'銀貨', 'RT':657},
    78:{'wrd':'急送', 'RT':685},
    79:{'wrd':'改選', 'RT':749},
    80:{'wrd':'表紙', 'RT':476},
    81:{'wrd':'指針', 'RT':487},
    82:{'wrd':'熱帯', 'RT':490},
    83:{'wrd':'作詞', 'RT':491},
    84:{'wrd':'決着', 'RT':491},
    85:{'wrd':'食費', 'RT':500},
    86:{'wrd':'古代', 'RT':501},
    87:{'wrd':'地形', 'RT':505},
    88:{'wrd':'役場', 'RT':531},
    89:{'wrd':'品種', 'RT':538},
    90:{'wrd':'祝福', 'RT':542},
    91:{'wrd':'金銭', 'RT':551},
    92:{'wrd':'根底', 'RT':562},
    93:{'wrd':'接種', 'RT':572},
    94:{'wrd':'経由', 'RT':605},
    95:{'wrd':'郷土', 'RT':622},
    96:{'wrd':'街路', 'RT':634},
    97:{'wrd':'宿直', 'RT':746},
    98:{'wrd':'曲折', 'RT':749},
    99:{'wrd':'越境', 'RT':827},
    100:{'wrd':'強引', 'RT':489},
    101:{'wrd':'寿命', 'RT':520},
    102:{'wrd':'豆腐', 'RT':520},
    103:{'wrd':'出前', 'RT':528},
    104:{'wrd':'歌声', 'RT':542},
    105:{'wrd':'近道', 'RT':560},
    106:{'wrd':'間口', 'RT':578},
    107:{'wrd':'風物', 'RT':596},
    108:{'wrd':'面影', 'RT':600},
    109:{'wrd':'眼鏡', 'RT':608},
    110:{'wrd':'居所', 'RT':612},
    111:{'wrd':'献立', 'RT':630},
    112:{'wrd':'小雨', 'RT':631},
    113:{'wrd':'毛皮', 'RT':656},
    114:{'wrd':'鳥居', 'RT':702},
    115:{'wrd':'仲買', 'RT':725},
    116:{'wrd':'頭取', 'RT':763},
    117:{'wrd':'極上', 'RT':770},
    118:{'wrd':'奉行', 'RT':856},
    119:{'wrd':'夢路', 'RT':858},
    120:{'wrd':'集学', 'RT':575},
    121:{'wrd':'信別', 'RT':588},
    122:{'wrd':'製信', 'RT':647},
    123:{'wrd':'運学', 'RT':653},
    124:{'wrd':'番送', 'RT':671},
    125:{'wrd':'電続', 'RT':680},
    126:{'wrd':'完意', 'RT':685},
    127:{'wrd':'軍開', 'RT':685},
    128:{'wrd':'動選', 'RT':691},
    129:{'wrd':'当働', 'RT':700},
    130:{'wrd':'予続', 'RT':702},
    131:{'wrd':'倉理', 'RT':704},
    132:{'wrd':'予少', 'RT':705},
    133:{'wrd':'教池', 'RT':711},
    134:{'wrd':'理任', 'RT':734},
    135:{'wrd':'銀務', 'RT':737},
    136:{'wrd':'連料', 'RT':748},
    137:{'wrd':'開員', 'RT':758},
    138:{'wrd':'注全', 'RT':763},
    139:{'wrd':'記争', 'RT':776},
    140:{'wrd':'作明', 'RT':587},
    141:{'wrd':'風行', 'RT':615},
    142:{'wrd':'失定', 'RT':620},
    143:{'wrd':'指団', 'RT':621},
    144:{'wrd':'決所', 'RT':629},
    145:{'wrd':'各算', 'RT':634},
    146:{'wrd':'海身', 'RT':642},
    147:{'wrd':'東発', 'RT':647},
    148:{'wrd':'楽験', 'RT':654},
    149:{'wrd':'作代', 'RT':661},
    150:{'wrd':'反原', 'RT':694},
    151:{'wrd':'独対', 'RT':710},
    152:{'wrd':'歌上', 'RT':737},
    153:{'wrd':'反定', 'RT':745},
    154:{'wrd':'独定', 'RT':756},
    155:{'wrd':'場家', 'RT':766},
    156:{'wrd':'安種', 'RT':767},
    157:{'wrd':'経着', 'RT':775},
    158:{'wrd':'決土', 'RT':777},
    159:{'wrd':'松合', 'RT':836},
    160:{'wrd':'表品', 'RT':570},
    161:{'wrd':'実定', 'RT':632},
    162:{'wrd':'人風', 'RT':641},
    163:{'wrd':'神間', 'RT':662},
    164:{'wrd':'相経', 'RT':680},
    165:{'wrd':'人元', 'RT':696},
    166:{'wrd':'小引', 'RT':702},
    167:{'wrd':'指場', 'RT':706},
    168:{'wrd':'毛所', 'RT':710},
    169:{'wrd':'台手', 'RT':712},
    170:{'wrd':'間物', 'RT':726},
    171:{'wrd':'道品', 'RT':738},
    172:{'wrd':'出取', 'RT':749},
    173:{'wrd':'建馬', 'RT':751},
    174:{'wrd':'大婦', 'RT':805},
    175:{'wrd':'地打', 'RT':817},
    176:{'wrd':'化間', 'RT':842},
    177:{'wrd':'面口', 'RT':842},
    178:{'wrd':'金由', 'RT':852},
    179:{'wrd':'彼間', 'RT':884},
    180:{'wrd':'急材', 'RT':616},
    181:{'wrd':'戦刊', 'RT':619},
    182:{'wrd':'返計', 'RT':635},
    183:{'wrd':'印念', 'RT':667},
    184:{'wrd':'低局', 'RT':671},
    185:{'wrd':'労号', 'RT':677},
    186:{'wrd':'満送', 'RT':710},
    187:{'wrd':'永告', 'RT':729},
    188:{'wrd':'試脈', 'RT':732},
    189:{'wrd':'観備', 'RT':734},
    190:{'wrd':'材約', 'RT':746},
    191:{'wrd':'夕局', 'RT':755},
    192:{'wrd':'医庫', 'RT':766},
    193:{'wrd':'任続', 'RT':777},
    194:{'wrd':'医貨', 'RT':785},
    195:{'wrd':'改練', 'RT':833},
    196:{'wrd':'区温', 'RT':833},
    197:{'wrd':'多始', 'RT':835},
    198:{'wrd':'材刷', 'RT':866},
    199:{'wrd':'持察', 'RT':916},
    200:{'wrd':'食占', 'RT':658},
    201:{'wrd':'表底', 'RT':659},
    202:{'wrd':'宿帯', 'RT':682},
    203:{'wrd':'決帯', 'RT':685},
    204:{'wrd':'古費', 'RT':688},
    205:{'wrd':'安敗', 'RT':692},
    206:{'wrd':'役針', 'RT':712},
    207:{'wrd':'近命', 'RT':720},
    208:{'wrd':'眼道', 'RT':729},
    209:{'wrd':'豆立', 'RT':744},
    210:{'wrd':'街直', 'RT':753},
    211:{'wrd':'固路', 'RT':765},
    212:{'wrd':'郷種', 'RT':786},
    213:{'wrd':'品路', 'RT':800},
    214:{'wrd':'曲銭', 'RT':813},
    215:{'wrd':'献居', 'RT':832},
    216:{'wrd':'奉買', 'RT':848},
    217:{'wrd':'根境', 'RT':872},
    218:{'wrd':'役岸', 'RT':882},
    219:{'wrd':'祝折', 'RT':959},
    220:{'wrd':'食形', 'RT':569},
    221:{'wrd':'接紙', 'RT':674},
    222:{'wrd':'競物', 'RT':677},
    223:{'wrd':'地詞', 'RT':698},
    224:{'wrd':'強腐', 'RT':757},
    225:{'wrd':'頭路', 'RT':800},
    226:{'wrd':'毛西', 'RT':804},
    227:{'wrd':'夜糸', 'RT':818},
    228:{'wrd':'仲影', 'RT':822},
    229:{'wrd':'熱福', 'RT':826},
    230:{'wrd':'寿前', 'RT':846},
    231:{'wrd':'鳥雨', 'RT':866},
    232:{'wrd':'地粧', 'RT':898},
    233:{'wrd':'越種', 'RT':926},
    234:{'wrd':'仲女', 'RT':938},
    235:{'wrd':'極鏡', 'RT':946},
    236:{'wrd':'夢皮', 'RT':997},
    237:{'wrd':'居声', 'RT':1009},
    238:{'wrd':'貸形', 'RT':1018},
    239:{'wrd':'夫幅', 'RT':1049}
}
# print(sorted([v['wrd'] for k, v in fushimi1999_rt.items()]))